{
  "backend/main.mo": "Main actor implementing user registration, project management, contact requests, analytics, and admin functions with role-based access control using MixinAuthorization and AccessControl modules.",
  "backend/migration.mo": "Migration module that transforms OldActor state to NewActor state by preserving existing data and initializing new fields (projectApplications, platformRevenue, activityReports, platformConfig).",
  "feature_evidence.json": "Feature evidence report documenting five frontend page updates (MyProjects, SkillProfile, Mentorship, StudentSettings, Applicants) that replace mock data with real backend integration using React Query hooks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including pages, components, hooks, and configuration, describing UI components with dark blue theme, role-based routing, and backend integration patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Bharat Silicon Setu application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with lazy-loaded pages for student, industry, and admin roles, QueryClientProvider, ProtectedRoute wrappers, RoleSelectionModal, and Toaster notifications.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that checks authentication and user role, redirecting unauthenticated users to landing page and users with mismatched roles to their appropriate dashboard.",
  "frontend/src/components/RoleSelectionModal.tsx": "A modal dialog that allows new users to select their role (Student, Industry Partner, or Admin) during registration, then navigates them to the appropriate dashboard.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAnalytics.ts": "Fetches analytics data from the backend using React Query.",
  "frontend/src/hooks/useContactRequests.ts": "Provides hooks to fetch contact requests and send new contact requests with message to other users.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state and provides login/logout functionality through React context, handling identity persistence and delegation validation.",
  "frontend/src/hooks/usePlatformConfig.ts": "Provides hooks to fetch and update platform configuration settings.",
  "frontend/src/hooks/usePlatformMetrics.ts": "Fetches platform-wide metrics including total users and total projects.",
  "frontend/src/hooks/useProjects.ts": "Provides comprehensive project management hooks including fetching approved/user projects, saving projects, managing applications, and admin approval/rejection functionality.",
  "frontend/src/hooks/useReports.ts": "Fetches report data either by date range or all reports from the backend.",
  "frontend/src/hooks/useRevenue.ts": "Provides hooks to fetch revenue data including total revenue, all revenue records, and monthly revenue breakdowns.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Fetches the current user's role and provides the appropriate dashboard path based on that role (student, industry partner, or admin).",
  "frontend/src/hooks/useUserProfile.ts": "React hook that fetches the current user's profile from the backend actor using React Query, with loading states and error handling.",
  "frontend/src/hooks/useUsers.ts": "React hook that fetches all user profiles from the backend actor using React Query.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like buttons, cards, sidebars, and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard layout with sidebar navigation for managing users, projects, revenue, reports, and settings, with conditional rendering for sub-routes using React Router outlets.",
  "frontend/src/pages/AdminProjects.tsx": "Admin page for reviewing and managing all platform projects with filtering by status and approve/reject functionality using backend mutations.",
  "frontend/src/pages/AdminSettings.tsx": "Admin settings page for managing platform configuration including site name, maintenance mode, and registration status with form state management and save functionality.",
  "frontend/src/pages/AISkillMapping.tsx": "Page component for AI-powered resume analysis that allows users to upload resumes and displays mock skill analysis results and project matches for semiconductor skills.",
  "frontend/src/pages/Applicants.tsx": "Displays and manages project applications for industry users, with filtering by project and the ability to send contact messages to applicants. Uses hooks for fetching applications, projects, and student profiles, and includes a dialog for composing messages.",
  "frontend/src/pages/IndustryAnalytics.tsx": "Shows analytics dashboard for industry users with key metrics including total applicants, active projects, and engagement rate. Displays project performance data with applicant counts per project.",
  "frontend/src/pages/IndustryDashboard.tsx": "Main dashboard layout for industry users with sidebar navigation to various sections (dashboard, post project, applicants, analytics, settings). Includes project creation dialog and handles routing to sub-pages via Outlet.",
  "frontend/src/pages/IndustrySettings.tsx": "Settings page for industry users to manage company profile information including name, email, and description. Includes form validation and uses mutation hooks to save profile updates.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page for Bharat Silicon Setu platform featuring hero section, navigation header, and login functionality. Handles authentication and role-based redirection to appropriate dashboards.",
  "frontend/src/pages/Mentorship.tsx": "Mentorship page that allows users to send messages to mentors/partners via Principal ID and displays received contact requests. Uses hooks for fetching and sending messages with form validation and toast notifications.",
  "frontend/src/pages/MyProjects.tsx": "Displays a student's project applications with status filtering (all, applied, in-progress, completed). Combines application data with project details using a map lookup and shows cards with project information and status badges.",
  "frontend/src/pages/Reports.tsx": "Admin reports page showing aggregated platform metrics (active users, applications, messages) with JSON export functionality. Displays key metrics in cards and requires admin permissions to view.",
  "frontend/src/pages/Revenue.tsx": "Admin revenue dashboard displaying total platform revenue and monthly breakdown for the last 6 months. Formats currency and dates, requires admin permissions to access.",
  "frontend/src/pages/SkillProfile.tsx": "User skill profile management page allowing users to add/remove technical skills to their profile. Loads existing skills from user profile and saves updates via mutation hook with validation.",
  "frontend/src/pages/StudentDashboard.tsx": "Main student dashboard component with sidebar navigation, displaying overview cards for projects, messages, skills, and profile completion. Conditionally renders nested routes via Outlet or the main dashboard view with tabs for projects, mentorship, and skill development.",
  "frontend/src/pages/StudentSettings.tsx": "Student settings page allowing users to update their profile information (name and email) with validation. Displays account information including principal ID and uses mutation hooks to save changes.",
  "frontend/src/pages/Users.tsx": "Admin page for viewing and managing all platform users with search and role filtering capabilities. Displays users in a table with badges indicating their role (admin, industry partner, or student).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing. Provides session storage integration for parameter persistence and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme settings including container queries, typography, animations, and custom font families (Inter and Space Grotesk).",
  "project_state.json": "Project state file tracking Bharat Silicon Setu, a semiconductor execution ecosystem SaaS platform with 19 implemented features including landing page, student/industry/startup/institution dashboards, and multi-stakeholder workflows. Built with React + Tailwind CSS using a dark blue professional theme and sidebar navigation pattern."
}