{
  "backend/main.mo": "Main backend actor implementing user registration with role-based access control (student/industryPartner/admin), user profile management, project CRUD operations, contact requests, and platform metrics tracking using Map-based storage.",
  "feature_evidence.json": "Feature evidence report documenting text color updates from black to white across LandingPage, StudentDashboard, IndustryDashboard, and AdminDashboard components for dark background visibility.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and configuration files with descriptions of their functionality and recent white text theme updates.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark modes with professional dark blue theme variables.",
  "frontend/index.html": "HTML entry point for the React application with title 'Bharat Silicon Setu' and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for landing, student/industry/admin dashboards, AI skill mapping, protected routes, and role selection modal with QueryClient provider.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that verifies authentication and role-based access, redirecting unauthenticated users to landing page and users with incorrect roles to their appropriate dashboard.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal dialog for first-time user role selection (student/industryPartner/admin) with large card-based UI, gradient icons, registration handling, and automatic navigation to role-specific dashboard.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useContactRequests.ts": "Provides hooks for fetching contact requests and sending new contact requests to other users via the backend actor, with automatic query invalidation on mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login/logout flow, identity persistence, and authentication state with configurable AuthClient options.",
  "frontend/src/hooks/usePlatformMetrics.ts": "Fetches platform-wide metrics (total users and projects) from the backend actor using React Query.",
  "frontend/src/hooks/useProjects.ts": "Provides hooks for fetching approved projects, user-specific projects, and saving projects with automatic cache invalidation.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Fetches the current user's role and provides the appropriate dashboard path based on role (student, industry partner, or admin).",
  "frontend/src/hooks/useUserProfile.ts": "Fetches the current user's profile from the backend actor with loading and error states.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, accent, and sidebar color schemes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with sidebar navigation showing platform metrics (total users and projects) and sections for managing users, projects, and activity.",
  "frontend/src/pages/AISkillMapping.tsx": "Displays an AI-powered resume analysis page where users can upload resumes to analyze semiconductor skills and view matching project recommendations with skill strength indicators.",
  "frontend/src/pages/IndustryDashboard.tsx": "Industry dashboard page with sidebar navigation, project creation dialog, and tabs for managing projects, applicants, and analytics. Includes logout functionality and displays project cards with skills and status badges.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, stakeholder information, and Internet Identity login integration. Features responsive header, role-based navigation to dashboards, and sections for how it works, impact, and AI skill mapping.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard with sidebar navigation showing profile completion, available projects, and messages. Displays mock skills, project cards with apply functionality, and tabs for overview, projects, and messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence helpers and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with custom fonts (Inter, Space Grotesk), animations, and shadcn/ui component styling including sidebar, chart, and card variants.",
  "project_state.json": "Project state tracking file for Bharat Silicon Setu, a semiconductor execution ecosystem SaaS platform with multi-stakeholder dashboards (students, industry, startups, institutions). Currently has a known issue with dashboard redirect navigation not working from the landing page."
}