{
  "backend/main.mo": "Main backend actor implementing user registration with role-based access control (student, industryPartner, admin), user profile management, project CRUD operations, contact requests, and platform metrics tracking using Map data structures and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented student dashboard pages (MyProjects, SkillProfile, Mentorship, StudentSettings), industry dashboard pages (Applicants), and their associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including styling configuration, main App component with routing, dashboard pages for all user roles, protected routes, hooks for backend integration, and UI components with dark blue professional theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining CSS variables for light and dark modes, including background, foreground, primary, secondary, accent, and sidebar colors with professional dark blue theme.",
  "frontend/index.html": "HTML entry point for the Bharat Silicon Setu application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with lazy-loaded routes for student, industry, and admin dashboards, protected route wrappers, role selection modal integration, and QueryClient provider setup with Toaster for notifications.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication status and role-based access, redirecting unauthenticated users to landing page and users with mismatched roles to their appropriate dashboard with loading states and console logging.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal component for new users to select their role (Student, Industry Partner, or Admin) during onboarding, handles registration via actor and redirects to appropriate dashboard.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useContactRequests.ts": "React Query hooks for fetching contact requests and sending new contact requests with automatic cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/usePlatformMetrics.ts": "React Query hook that fetches platform-wide metrics (total users and projects) from the backend actor.",
  "frontend/src/hooks/useProjects.ts": "React Query hooks for fetching approved/user projects and mutations for saving projects and user profiles with cache invalidation.",
  "frontend/src/hooks/useRoleBasedRedirect.ts": "Hook that fetches the current user's role and provides the appropriate dashboard path based on role (student, industry partner, or admin).",
  "frontend/src/hooks/useUserProfile.ts": "React Query hook for fetching the current authenticated user's profile from the backend with loading and error states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors including primary, secondary, accent, and sidebar color schemes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with sidebar navigation to Users, Projects, Revenue, Reports, and Settings sections. Displays platform metrics overview cards and handles admin logout functionality.",
  "frontend/src/pages/AdminProjects.tsx": "Admin page for reviewing and moderating platform projects with filtering by status (pending/approved/rejected). Includes approve/reject functionality with mock pending projects for demonstration.",
  "frontend/src/pages/AdminSettings.tsx": "Admin settings page for configuring platform options (site name, maintenance mode, registration) and managing user access control with role assignment functionality.",
  "frontend/src/pages/AISkillMapping.tsx": "Page component for AI-powered resume analysis that allows users to upload resumes, simulates skill extraction, and displays matching projects with skill strength indicators.",
  "frontend/src/pages/Applicants.tsx": "Page displaying mock applicant data with skill matching percentages and project filtering. Includes dialog for sending contact request messages to applicants.",
  "frontend/src/pages/IndustryAnalytics.tsx": "Analytics dashboard showing project performance metrics including total applicants, active projects, and engagement rates. Contains placeholder for chart visualization of application trends.",
  "frontend/src/pages/IndustryDashboard.tsx": "Main dashboard page for industry users with sidebar navigation, project creation dialog, and tabs for overview/projects/analytics. Handles authentication, project management, and routing to sub-pages via Outlet.",
  "frontend/src/pages/IndustrySettings.tsx": "Settings page for industry users to manage company profile information (name, email, description) and preferences. Uses user profile hooks to load and save data.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, navigation header, and login functionality. Handles Internet Identity authentication and role-based redirection to appropriate dashboards.",
  "frontend/src/pages/Mentorship.tsx": "Mentorship page allowing users to send messages to mentors via Principal ID and view received contact requests. Includes message composition form and message list display.",
  "frontend/src/pages/MyProjects.tsx": "Student/user page displaying their project applications with status filtering (Applied/In Progress/Completed). Shows project details including title, description, and required skills.",
  "frontend/src/pages/Reports.tsx": "Admin reports page displaying platform activity metrics (daily active users, project applications, messages) with date range filtering and JSON export functionality. Currently uses mock data with a note that backend integration is pending.",
  "frontend/src/pages/Revenue.tsx": "Admin revenue dashboard showing mock financial metrics including total revenue, monthly breakdown, and subscription tier statistics. Displays placeholder data with a note that backend revenue tracking integration is pending.",
  "frontend/src/pages/SkillProfile.tsx": "Student skill profile management page allowing users to add, remove, and view technical skills with proficiency percentages. Integrates with useUserProfile and useSaveCallerUserProfile hooks for data persistence.",
  "frontend/src/pages/StudentDashboard.tsx": "Main student dashboard with sidebar navigation to projects, skill profile, mentorship, and settings. Fetches approved projects and contact requests, handles logout, and renders nested routes via Outlet when on sub-routes.",
  "frontend/src/pages/StudentSettings.tsx": "Student settings page for managing profile information (name, email, bio) and notification preferences. Uses useUserProfile and useSaveCallerUserProfile hooks to load and persist user data.",
  "frontend/src/pages/Users.tsx": "Users management page displaying a table of platform users (students, industry partners, admins) with search and role filtering capabilities using mock data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, typography, animations, and theme extensions for the dark blue professional UI.",
  "project_state.json": "Project state tracking document for Bharat Silicon Setu platform, listing implemented features including landing page, student dashboard, industry dashboard, and multi-stakeholder components."
}