{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement full functionality for all Student, Industry, and Admin dashboard pages",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Update MyProjects page to fetch real user projects from backend using useProjects hook",
      "acceptanceCriteria": [
        "MyProjects page displays real user projects from backend",
        "Project status indicators reflect actual data from backend",
        "Page handles loading and error states appropriately",
        "Empty state message shown when user has no projects"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyProjects.tsx",
          "operation": "modify",
          "description": "Replace mock data with useProjects hook to fetch real student project applications from backend. Use the getStudentApplications backend method to retrieve actual applications. Add loading spinner during data fetch, display error states with toast notifications, and show empty state message when no applications exist. Map backend ProjectApplication data to display project title, description, status, and required skills. Filter applications by status tabs (Applied, In Progress, Completed)."
        },
        {
          "path": "frontend/src/hooks/useProjects.ts",
          "operation": "modify",
          "description": "Add useStudentApplications hook that calls actor.getStudentApplications() to retrieve project applications for the current authenticated user. Include proper error handling and loading states. Return applications array with status, timestamp, student, and project principals."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Update SkillProfile page to display and persist actual user skills from backend",
      "acceptanceCriteria": [
        "Skill profile loads real user data from backend",
        "Add skill functionality works and persists to backend",
        "Remove skill functionality works and updates backend",
        "Success toast notification shown after saving",
        "Validation prevents adding duplicate or empty skills"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SkillProfile.tsx",
          "operation": "modify",
          "description": "Integrate useUserProfile hook to load actual user skills from backend UserProfile. Replace mock skills array with profile.skills from backend data. Implement add skill functionality that validates for empty strings and duplicates before adding to local state. Implement remove skill functionality. Use useSaveCallerUserProfile mutation to persist skill changes to backend when user clicks save. Show loading spinner while fetching profile, display success toast after successful save, and show error toast if save fails. Ensure skills are stored as string array in the user profile."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Update Mentorship page to fetch and send real contact requests using hooks",
      "acceptanceCriteria": [
        "Mentorship page displays real received contact requests from backend",
        "Send message form validates recipient Principal ID format",
        "Messages are successfully sent to backend and confirmed with toast",
        "Message list updates automatically after sending",
        "Empty state shown when no messages exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Mentorship.tsx",
          "operation": "modify",
          "description": "Replace mock messages with useContactRequests hook to fetch real contact requests from backend. Display received messages with sender principal, message content, and timestamp. Implement send message form that validates recipient Principal ID format using Principal.fromText() with try-catch for validation errors. Use useSendContactRequest mutation to send messages to backend. Show success toast after message sent and automatically refresh message list. Display loading spinner while fetching messages and show empty state with helpful message when no contact requests exist."
        },
        {
          "path": "frontend/src/hooks/useContactRequests.ts",
          "operation": "modify",
          "description": "Ensure useSendContactRequest mutation properly invalidates the contact requests query cache after successful send so the message list refreshes automatically. Add proper error handling with descriptive error messages for Principal ID validation failures and backend errors."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Update StudentSettings page to load and save real user profile data",
      "acceptanceCriteria": [
        "Settings page loads actual user profile data",
        "Form fields are populated with current user data",
        "Save functionality persists changes to backend",
        "Success toast shown after successful save",
        "Validation prevents saving invalid data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudentSettings.tsx",
          "operation": "modify",
          "description": "Integrate useUserProfile hook to load actual user profile data from backend. Populate form fields (name, email, bio) with current profile data when loaded. Implement form validation for required fields and valid email format. Use useSaveCallerUserProfile mutation to persist profile changes when user clicks save. Show loading state while fetching profile, display success toast notification after successful save, and show error toast with error message if save fails. Ensure form state syncs with loaded profile data."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Update Applicants page to fetch real project applicants from backend",
      "acceptanceCriteria": [
        "Applicants page displays real applications from backend",
        "Skill match percentages calculated from actual student data",
        "Filter by project works with real project list",
        "Contact request dialog sends messages to backend",
        "Empty state shown when no applicants exist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Applicants.tsx",
          "operation": "modify",
          "description": "Replace mock applicants data with new hook that fetches real project applications from backend using getProjectApplications method. For each application, fetch the student profile using getUserProfile(application.student) to get skills. Calculate skill match percentage by comparing student skills with project required skills. Implement project filter dropdown that fetches user's projects using getUserProjects and filters applications by selected project. Integrate useSendContactRequest mutation in contact dialog to send messages to applicants. Display loading spinner during data fetch, show empty state when no applications exist, and handle errors gracefully with toast notifications."
        },
        {
          "path": "frontend/src/hooks/useProjects.ts",
          "operation": "modify",
          "description": "Add useProjectApplications hook that calls actor.getProjectApplications() to retrieve all applications for the current industry partner's projects. Include proper loading and error states. Add useStudentProfile hook that accepts a Principal and calls actor.getUserProfile(principal) to fetch student profile data including skills for skill matching calculations."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Update IndustryAnalytics page to display real analytics data from backend",
      "acceptanceCriteria": [
        "Analytics page fetches real metrics from backend",
        "Total applicants count reflects actual application data",
        "Active projects count shows real project status data",
        "Engagement rate calculated from actual platform activity",
        "Data updates when new applications or projects are created"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IndustryAnalytics.tsx",
          "operation": "modify",
          "description": "Replace mock analytics data with new hook that fetches real analytics from backend using getAnalyticsData method. Display actual total applicants count from projectApplicantCounts aggregation, show active projects count from backend data, and display engagement rate percentage. Add loading spinner while fetching analytics, handle errors with error message display, and ensure metrics refresh when navigating to the page. Keep the chart visualization placeholder for now but populate the metrics cards with real data."
        },
        {
          "path": "frontend/src/hooks/useAnalytics.ts",
          "operation": "create",
          "description": "Create React Query hook useAnalyticsData that calls actor.getAnalyticsData() to fetch analytics metrics for the current industry partner. Return activeProjects count, total applicants (sum of projectApplicantCounts), and engagementRate. Include proper error handling and loading states. Export the hook for use in IndustryAnalytics page."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Update IndustrySettings page to load and save actual company profile data",
      "acceptanceCriteria": [
        "Industry settings page loads real company profile data",
        "Form fields populate with current company information",
        "Save button persists changes to backend",
        "Success notification shown after saving",
        "Form validation prevents invalid inputs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IndustrySettings.tsx",
          "operation": "modify",
          "description": "Integrate useUserProfile hook to load actual company profile data from backend. Populate form fields (company name, email, description) with current profile data. Implement form validation for required fields and email format. Use useSaveCallerUserProfile mutation to persist changes to backend. Show loading state while fetching profile, display success toast after successful save, and show error toast if save fails. Ensure form initializes with loaded profile data."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Update Users page to fetch and display real platform users from backend",
      "acceptanceCriteria": [
        "Users page displays all registered users from backend",
        "Search box filters users by name or email in real-time",
        "Role filter shows only users with selected role",
        "User table shows actual registration dates and roles",
        "Pagination or infinite scroll for large user lists"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Users.tsx",
          "operation": "modify",
          "description": "Replace mock users data with new hook that fetches all platform users from backend using getAllUsers method. Display real user data including name, email, role, and registration timestamp. Implement client-side search filtering that filters users by name or email as user types. Implement role filter dropdown (All/Student/Industry Partner/Admin) that filters displayed users by AppUserRole. Format registration dates using date formatting. Add loading spinner while fetching users and handle errors with error display. Consider pagination for performance if user count exceeds reasonable limit."
        },
        {
          "path": "frontend/src/hooks/useUsers.ts",
          "operation": "create",
          "description": "Create React Query hook useAllUsers that calls actor.getAllUsers() to fetch all registered platform users. Return array of UserProfile objects with name, email, role, registration timestamp, and principal ID. Include proper authorization check awareness (admin-only). Add loading and error states. Export hook for use in Users page."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Update AdminProjects page to fetch real projects and implement approve/reject functionality",
      "acceptanceCriteria": [
        "Admin projects page displays all platform projects from backend",
        "Filter by status shows projects with matching approval state",
        "Approve button updates project status to approved in backend",
        "Reject button updates project status to rejected in backend",
        "Success notifications shown after status changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProjects.tsx",
          "operation": "modify",
          "description": "Replace mock projects with new hook that fetches all platform projects from backend using getAllProjects method. Display projects with title, description, created by principal, required skills, and approval status. Implement status filter dropdown (All/Pending/Approved/Rejected) that filters projects by approval status. Create approve and reject mutation hooks that call approveProject and rejectProject backend methods with projectCreator principal and projectIndex. Show success toast after approve/reject operations and automatically refresh project list. Add loading states for both data fetch and approve/reject operations. Handle errors with error toast notifications."
        },
        {
          "path": "frontend/src/hooks/useProjects.ts",
          "operation": "modify",
          "description": "Add useAllProjects hook that calls actor.getAllProjects() to fetch all platform projects for admin review. Add useApproveProject mutation that calls actor.approveProject(projectCreator, projectIndex) and invalidates project queries. Add useRejectProject mutation that calls actor.rejectProject(projectCreator, projectIndex) and invalidates project queries. Include proper authorization awareness (admin-only) and error handling."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Update Revenue page to fetch and display actual platform revenue data from backend",
      "acceptanceCriteria": [
        "Revenue page fetches real financial data from backend",
        "Total revenue displays actual calculated amount",
        "Monthly breakdown shows revenue per month from backend",
        "Subscription tier statistics reflect actual user subscription data",
        "Data updates when new revenue is recorded"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Revenue.tsx",
          "operation": "modify",
          "description": "Replace mock revenue data with new hooks that fetch real revenue data from backend. Use getTotalRevenue method to display total platform revenue. Use getAllRevenue method to get revenue records with timestamps, then aggregate by month for monthly breakdown chart. Calculate subscription tier statistics by querying user profiles and counting users by subscription tier (if available in profile). Add loading spinner while fetching data, handle errors with error display, and ensure data refreshes when new revenue is added. Format currency values properly."
        },
        {
          "path": "frontend/src/hooks/useRevenue.ts",
          "operation": "create",
          "description": "Create React Query hooks for revenue data. useRevenueTotal calls actor.getTotalRevenue() to get total platform revenue. useAllRevenue calls actor.getAllRevenue() to get all revenue records with timestamps for monthly breakdown. useMonthlyRevenue accepts month and year parameters and calls actor.getMonthlyRevenue(month, year). Include proper authorization awareness (admin-only) and error handling. Export hooks for use in Revenue page."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Update Reports page to fetch real platform activity data with date filtering and export",
      "acceptanceCriteria": [
        "Reports page displays actual platform activity metrics",
        "Date range filter queries backend for specific time period",
        "Daily active users count reflects actual login activity",
        "Project applications count shows real application data",
        "Export button downloads actual data as JSON file"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Reports.tsx",
          "operation": "modify",
          "description": "Replace mock reports data with new hook that fetches real platform reports from backend. Use getReportsByDateRange method with start and end date parameters to fetch activity metrics for selected date range. Display daily active users, project applications, and messages sent from backend ReportData. Implement date range picker that updates the query with new date range. Implement export functionality that takes actual fetched data and downloads as JSON file. Add loading spinner while fetching reports, handle errors with error display, and show empty state when no reports exist for selected date range."
        },
        {
          "path": "frontend/src/hooks/useReports.ts",
          "operation": "create",
          "description": "Create React Query hook useReportsByDateRange that accepts startDate and endDate parameters (Time/bigint) and calls actor.getReportsByDateRange(startDate, endDate) to fetch platform activity reports. Return array of ReportData with dailyActiveUsers, projectApplications, messagesSent, startDate, and endDate. Include proper authorization awareness (admin-only) and error handling. Export hook for use in Reports page."
        }
      ]
    },
    {
      "id": "REQ-70",
      "summary": "Update AdminSettings page to load and save actual platform configuration settings",
      "acceptanceCriteria": [
        "Admin settings page loads current platform settings from backend",
        "Site name field updates platform configuration",
        "Maintenance mode toggle persists to backend",
        "User access control settings save successfully",
        "Success notifications shown after saving settings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSettings.tsx",
          "operation": "modify",
          "description": "Replace mock platform settings with new hooks that fetch and update real platform configuration from backend. Use getPlatformConfig method to load current settings including siteName, maintenanceMode, and registrationOpen. Populate form fields with loaded configuration. Implement save functionality using updatePlatformConfig mutation that persists changes to backend. Add loading spinner while fetching config, show success toast after successful save, and handle errors with error toast. Ensure toggle switches and text inputs are bound to form state. Keep existing user access control role assignment functionality using assignCallerUserRole."
        },
        {
          "path": "frontend/src/hooks/usePlatformConfig.ts",
          "operation": "create",
          "description": "Create React Query hooks for platform configuration. usePlatformConfig calls actor.getPlatformConfig() to fetch current platform settings (siteName, maintenanceMode, registrationOpen). useUpdatePlatformConfig mutation calls actor.updatePlatformConfig(newConfig) to persist configuration changes and invalidates platform config query. Include proper authorization awareness (admin-only) and error handling. Export hooks for use in AdminSettings page."
        }
      ]
    }
  ]
}