{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement functional sidebar navigation pages for all dashboards",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Create My Projects page for Student Dashboard displaying user projects with status indicators and filtering",
      "acceptanceCriteria": [
        "Page is accessible via Student Dashboard sidebar navigation",
        "Displays all user-specific projects fetched from backend",
        "Shows project status badges (Applied, In Progress, Completed)",
        "Includes project title, description, and application date",
        "Uses white text on dark background for consistency"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyProjects.tsx",
          "operation": "create",
          "description": "Create My Projects page component that fetches user projects using the useProjects hook (getUserProjects backend method). Display projects in a grid layout with cards showing project title, description, skills required, and status badges. Include filter dropdown for status (Applied, In Progress, Completed). Use white text on dark background with Tailwind classes. Ensure the component handles loading and error states properly."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Create Skill Profile page for Student Dashboard to display and edit student skills and certifications",
      "acceptanceCriteria": [
        "Page is accessible via Student Dashboard sidebar navigation",
        "Displays skill tags with strength percentages (VLSI, RTL, Embedded Systems, FPGA)",
        "Includes editable fields for adding/removing skills",
        "Shows certifications and educational background",
        "Has a save button that persists changes to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SkillProfile.tsx",
          "operation": "create",
          "description": "Create Skill Profile page component that displays the current user's skills, certifications, and education. Fetch user profile using useUserProfile hook. Display skill tags with visual strength indicators (use progress bars or percentage badges). Include editable form fields for adding/removing skills with inline editing capability. Add a save button that calls saveCallerUserProfile to persist changes. Use white text styling with dark background. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Create Mentorship page for Student Dashboard to display mentor messages and manage mentorship requests",
      "acceptanceCriteria": [
        "Page is accessible via Student Dashboard sidebar navigation",
        "Displays list of mentor messages from contact requests",
        "Includes message composition interface with send functionality",
        "Shows mentorship request status (Pending, Accepted, Active)",
        "Uses white text styling consistently"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Mentorship.tsx",
          "operation": "create",
          "description": "Create Mentorship page component that fetches contact requests using useContactRequests hook. Display received messages in a list with sender name, message content, and timestamp. Include a message composition form with recipient selector and textarea for message content, using sendContactRequest mutation. Add status badges for mentorship requests (Pending, Accepted, Active). Use white text on dark background with proper spacing and typography. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Create Settings page for Student Dashboard to manage profile and notification preferences",
      "acceptanceCriteria": [
        "Page is accessible via Student Dashboard sidebar navigation",
        "Includes editable profile fields (name, email, bio)",
        "Has notification preference toggles",
        "Includes save button that persists changes to backend",
        "Uses white text on dark background"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudentSettings.tsx",
          "operation": "create",
          "description": "Create Student Settings page component that fetches current user profile using useUserProfile hook. Display editable form fields for name, email, and bio. Add notification preference toggle switches (mock implementation since notification preferences are not in backend interface). Include save button that calls saveCallerUserProfile to persist profile changes. Use white text styling with dark background. Display success/error messages after save attempts. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Create Applicants page for Industry Dashboard showing student applicants with skill matching and contact functionality",
      "acceptanceCriteria": [
        "Page is accessible via Industry Dashboard sidebar navigation",
        "Displays student applicant cards with skill match percentages",
        "Shows skill tags for each applicant (VLSI, RTL, Embedded Systems, FPGA)",
        "Includes filter dropdown to view applicants by specific project",
        "Has contact/message button for each applicant"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Applicants.tsx",
          "operation": "create",
          "description": "Create Applicants page component that displays mock student applicants (since backend does not have applicant tracking). Show applicant cards with name, skill tags, and skill match percentages. Include project filter dropdown. Add contact button for each applicant that opens a message dialog using sendContactRequest mutation from useContactRequests. Use white text on dark background. Include placeholder message explaining that applicant tracking will be connected to backend in future iterations."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Create Analytics page for Industry Dashboard displaying project metrics and engagement statistics",
      "acceptanceCriteria": [
        "Page is accessible via Industry Dashboard sidebar navigation",
        "Shows total applicants count across all projects",
        "Displays active projects count",
        "Includes engagement rate percentage metric",
        "Has growth chart visualization placeholder",
        "Uses white text for all labels and metrics"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IndustryAnalytics.tsx",
          "operation": "create",
          "description": "Create Industry Analytics page component that fetches user projects using useProjects hook to calculate active projects count. Display metric cards showing total applicants (mock data), active projects count, and engagement rate percentage (mock calculation). Include a growth chart placeholder using a div with mock chart visualization or chart library. Use white text styling for all labels and metrics on dark background. Handle loading states."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Create Settings page for Industry Dashboard to manage company profile and team preferences",
      "acceptanceCriteria": [
        "Page is accessible via Industry Dashboard sidebar navigation",
        "Includes editable company profile fields (company name, description, contact info)",
        "Has save button that persists changes to backend",
        "Uses white text styling consistently",
        "Includes sections for team management and preferences"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IndustrySettings.tsx",
          "operation": "create",
          "description": "Create Industry Settings page component that fetches current user profile using useUserProfile hook. Display editable form fields for company name (use profile name field), email, and company description (mock field). Add sections for team management (placeholder UI) and posting preferences (placeholder toggles). Include save button that calls saveCallerUserProfile to persist profile changes. Use white text styling with dark background. Display success/error messages. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Create Users page for Admin Dashboard with user management, filtering, and search functionality",
      "acceptanceCriteria": [
        "Page is accessible via Admin Dashboard sidebar navigation",
        "Displays user list with role badges (Student, Industry Partner, Admin)",
        "Includes search functionality to find users by name or email",
        "Has filter dropdown to view users by role",
        "Shows user registration dates and status",
        "Uses white text on dark background"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Users.tsx",
          "operation": "create",
          "description": "Create Users page component that displays mock user list (since backend does not expose user listing for admins). Show user cards/table with name, email, role badges (Student, Industry Partner, Admin), and registration dates. Include search input field for filtering by name/email and role filter dropdown. Use white text on dark background with proper table or card layout. Add placeholder message indicating that user management backend integration is pending."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Create Projects page for Admin Dashboard with project approval and moderation tools",
      "acceptanceCriteria": [
        "Page is accessible via Admin Dashboard sidebar navigation",
        "Displays all projects with status badges (Pending, Approved, Rejected)",
        "Shows project details including company name, title, and application count",
        "Includes approve/reject action buttons for pending projects",
        "Has filtering by project status",
        "Uses white text styling consistently"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProjects.tsx",
          "operation": "create",
          "description": "Create Admin Projects page component that fetches all projects using useProjects hook (getApprovedProjects - note: this only returns approved projects, so add mock pending/rejected projects for demonstration). Display project cards with title, description, company name (use createdBy principal), status badges (Pending, Approved, Rejected), and application count (mock data). Include approve/reject action buttons that update project approval status via saveProject mutation. Add status filter dropdown. Use white text styling on dark background. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Create Revenue page for Admin Dashboard displaying platform financial metrics and growth charts",
      "acceptanceCriteria": [
        "Page is accessible via Admin Dashboard sidebar navigation",
        "Shows total revenue generated metric",
        "Displays monthly revenue breakdown",
        "Includes subscription tier statistics",
        "Has revenue growth chart placeholder",
        "Uses white text for all financial data and labels"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Revenue.tsx",
          "operation": "create",
          "description": "Create Revenue page component that displays mock financial metrics (since backend does not have revenue tracking). Show metric cards for total revenue, monthly revenue breakdown, and subscription tier statistics. Include a revenue growth chart placeholder using a div with mock visualization or chart library. Use white text styling for all financial data and labels on dark background. Add disclaimer that this is mock data pending backend integration."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Create Reports page for Admin Dashboard with activity reports and export functionality",
      "acceptanceCriteria": [
        "Page is accessible via Admin Dashboard sidebar navigation",
        "Displays recent activity feed with user actions and timestamps",
        "Shows engagement metrics (daily active users, project applications, messages sent)",
        "Includes date range selector for custom report periods",
        "Has export button to download report data",
        "Uses white text on dark background consistently"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Reports.tsx",
          "operation": "create",
          "description": "Create Reports page component that displays mock activity feed and engagement metrics (since backend does not expose activity logs). Show recent activity list with user actions, timestamps, and action types. Display metric cards for daily active users, project applications, and messages sent (mock data). Include date range selector using date input fields. Add export button that triggers CSV/JSON download of mock report data. Use white text styling on dark background. Handle loading states."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Create Settings page for Admin Dashboard to configure platform settings and access controls",
      "acceptanceCriteria": [
        "Page is accessible via Admin Dashboard sidebar navigation",
        "Includes platform configuration options",
        "Has access control management interface",
        "Shows system preferences with save functionality",
        "Uses white text styling consistently"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSettings.tsx",
          "operation": "create",
          "description": "Create Admin Settings page component with sections for platform configuration, access control management, and system preferences. Display form fields for platform settings (mock configuration options like site name, maintenance mode toggle). Include access control section showing role assignments (use assignCallerUserRole capability from authorization component). Add save button for persisting settings (mock implementation). Use white text styling with dark background. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Update StudentDashboard to use React Router Link components for sidebar navigation",
      "acceptanceCriteria": [
        "Sidebar navigation items use React Router Link components",
        "Clicking 'My Projects' navigates to /student/my-projects",
        "Clicking 'Skill Profile' navigates to /student/skill-profile",
        "Clicking 'Mentorship' navigates to /student/mentorship",
        "Clicking 'Settings' navigates to /student/settings",
        "Active route is highlighted in the sidebar"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StudentDashboard.tsx",
          "operation": "modify",
          "description": "Replace hardcoded sidebar anchor tags with React Router Link components imported from '@tanstack/react-router'. Update navigation items to link to /student/my-projects, /student/skill-profile, /student/mentorship, and /student/settings. Add active route highlighting by checking current pathname and applying active classes to the matching Link. Preserve existing white text styling and sidebar layout. Ensure the Dashboard link remains as the default view."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Update IndustryDashboard to use React Router Link components for sidebar navigation",
      "acceptanceCriteria": [
        "Sidebar navigation items use React Router Link components",
        "Clicking 'Applicants' navigates to /industry/applicants",
        "Clicking 'Analytics' navigates to /industry/analytics",
        "Clicking 'Settings' navigates to /industry/settings",
        "Active route is highlighted in the sidebar"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IndustryDashboard.tsx",
          "operation": "modify",
          "description": "Replace hardcoded sidebar anchor tags with React Router Link components imported from '@tanstack/react-router'. Update navigation items to link to /industry/applicants, /industry/analytics, and /industry/settings. Add active route highlighting by checking current pathname and applying active classes to the matching Link. Preserve existing white text styling and sidebar layout. Ensure the Dashboard link remains as the default view."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Update AdminDashboard to use React Router Link components for sidebar navigation",
      "acceptanceCriteria": [
        "Sidebar navigation items use React Router Link components",
        "Clicking 'Users' navigates to /admin/users",
        "Clicking 'Projects' navigates to /admin/projects",
        "Clicking 'Revenue' navigates to /admin/revenue",
        "Clicking 'Reports' navigates to /admin/reports",
        "Clicking 'Settings' navigates to /admin/settings",
        "Active route is highlighted in the sidebar"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Replace hardcoded sidebar anchor tags with React Router Link components imported from '@tanstack/react-router'. Update navigation items to link to /admin/users, /admin/projects, /admin/revenue, /admin/reports, and /admin/settings. Add active route highlighting by checking current pathname and applying active classes to the matching Link. Preserve existing white text styling, platform metrics display, and sidebar layout. Ensure the Dashboard link remains as the default view."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Update App.tsx to add route definitions for all new dashboard pages with role-based protection",
      "acceptanceCriteria": [
        "All student sub-routes are registered with 'student' role protection",
        "All industry sub-routes are registered with 'industryPartner' role protection",
        "All admin sub-routes are registered with 'admin' role protection",
        "Routes use lazy loading for page components",
        "Navigation between routes works correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route definitions for all new dashboard pages in the router configuration. Create student routes: /student/my-projects (MyProjects), /student/skill-profile (SkillProfile), /student/mentorship (Mentorship), /student/settings (StudentSettings). Create industry routes: /industry/applicants (Applicants), /industry/analytics (IndustryAnalytics), /industry/settings (IndustrySettings). Create admin routes: /admin/users (Users), /admin/projects (AdminProjects), /admin/revenue (Revenue), /admin/reports (Reports), /admin/settings (AdminSettings). Wrap all routes with ProtectedRoute component using appropriate role props ('student', 'industryPartner', 'admin'). Use lazy loading for all new page components. Ensure routes are nested under their respective dashboard parent routes to maintain layout consistency."
        }
      ]
    }
  ]
}